Revit 2027 API
FabricationRodInfo.SetRodLockedWithHost Method
 Locks the rod with the host. The method is applicable only for bearer hanger.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetRodLockedWithHost(
	int rodIndex,
	bool locked
)
Public Sub SetRodLockedWithHost (
	rodIndex As Integer,
	locked As Boolean
)
public:
void SetRodLockedWithHost(
	int rodIndex,
	bool locked
)
member SetRodLockedWithHost :
        rodIndex : int *
        locked : bool -> unit
Parameters
rodIndex Int32
 The index of the rod.
locked Boolean
 Locks the rod with the host.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  the index rodIndex is should be in range of rod count.
InvalidOperationException |  The hanger is not a bearer hanger.
See Also
Reference
FabricationRodInfo Class
Autodesk.Revit.DB Namespace